from models.Regression.DecisionTreeRegressor import DecisionTreeRegressorClass
from models.Regression.ElasticNet import ElasticNetClass
from models.Regression.GradientBoostingRegressor import GradientBoostingRegressorClass
from models.Regression.KNeighborsRegression import KNeighborsRegressorClass
from models.Regression.Lasso import LassoClass
from models.Regression.LinearRegression import LinearRegressionClass
from models.Regression.MLPRegressor import MLPRegressorClass
from models.Regression.RandomForestRegressor import RandomForestRegressorClass
from models.Regression.Ridge import RidgeClass
from models.Regression.SVR import SVRClass

print("DecisionTreeRegressor")
Decision = DecisionTreeRegressorClass()
# Применить настройки
Decision.setData()
# Установить данные для прогноза
Decision.setPredict()
# Приминить модель
Decision.getData()
# Получить дополнительную информацию
# Decision.getInfo()
# Вывести данные из БД
# Decision.getDb()
# Получить прогноз
Decision.getPredict()
print("------------------------------------------")

print("ElasticNet")
Elastic = ElasticNetClass()
# Применить настройки
Elastic.setData()
# Установить данные для прогноза
Elastic.setPredict()
# Приминить модель
Elastic.getData()
# Получить дополнительную информацию
# Elastic.getInfo()
# Вывести данные из БД
# Elastic.getDb()
# Получить прогноз
Elastic.getPredict()
print("------------------------------------------")

print("GradientBoostingRegressor")
Gradient = GradientBoostingRegressorClass()
# Применить настройки
Gradient.setData()
# Установить данные для прогноза
Gradient.setPredict()
# Приминить модель
Gradient.getData()
# Получить дополнительную информацию
# Gradient.getInfo()
# Вывести данные из БД
# Gradient.getDb()
# Получить прогноз
Gradient.getPredict()
print("------------------------------------------")

print("KNeighborsRegressor")
KNeighbors = KNeighborsRegressorClass()
# Применить настройки
KNeighbors.setData()
# Установить данные для прогноза
KNeighbors.setPredict()
# Приминить модель
KNeighbors.getData()
# Получить дополнительную информацию
# KNeighbors.getInfo()
# Вывести данные из БД
# KNeighbors.getDb()
# Получить прогноз
KNeighbors.getPredict()
print("------------------------------------------")

print("Lasso")
Lasso = LassoClass()
# Применить настройки
Lasso.setData()
# Установить данные для прогноза
Lasso.setPredict()
# Приминить модель
Lasso.getData()
# Получить дополнительную информацию
# Lasso.getInfo()
# Вывести данные из БД
# Lasso.getDb()
# Получить прогноз
Lasso.getPredict()
print("------------------------------------------")

print("LinearRegression")
Linear = LinearRegressionClass()
# Применить настройки
Linear.setData()
# Установить данные для прогноза
Linear.setPredict()
# Приминить модель
Linear.getData()
# Получить дополнительную информацию
# Linear.getInfo()
# Вывести данные из БД
# Linear.getDb()
# Получить прогноз
Linear.getPredict()
print("------------------------------------------")

print("MLPRegressor")
MLP = MLPRegressorClass()
# Применить настройки
MLP.setData()
# Установить данные для прогноза
MLP.setPredict()
# Приминить модель
MLP.getData()
# Получить дополнительную информацию
# MLP.getInfo()
# Вывести данные из БД
# MLP.getDb()
# Получить прогноз
MLP.getPredict()
print("------------------------------------------")

print("RandomForestRegressor")
RandomForest = RandomForestRegressorClass()
# Применить настройки
RandomForest.setData()
# Установить данные для прогноза
RandomForest.setPredict()
# Приминить модель
RandomForest.getData()
# Получить дополнительную информацию
# RandomForest.getInfo()
# Вывести данные из БД
# RandomForest.getDb()
# Получить прогноз
RandomForest.getPredict()
print("------------------------------------------")

print("Ridge")
Ridge = RidgeClass()
# Применить настройки
Ridge.setData()
# Установить данные для прогноза
Ridge.setPredict()
# Приминить модель
Ridge.getData()
# Получить дополнительную информацию
# Ridge.getInfo()
# Вывести данные из БД
# Ridge.getDb()
# Получить прогноз
Ridge.getPredict()
print("------------------------------------------")

print("SVR")
SVR = SVRClass()
# Применить настройки
SVR.setData()
# Установить данные для прогноза
SVR.setPredict()
# Приминить модель
SVR.getData()
# Получить дополнительную информацию
# SVR.getInfo()
# Вывести данные из БД
# SVR.getDb()
# Получить прогноз
SVR.getPredict()
print("------------------------------------------")

